#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "centralus"
      + name     = "rg-quotesapp-prod"
      + tags     = {
          + "Environment" = "Production"
          + "Owner"       = "Rahul"
          + "Project"     = "QuotesApp"
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # time_sleep.wait_rg will be created
  + resource "time_sleep" "wait_rg" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

  # time_sleep.wait_vnet will be created
  + resource "time_sleep" "wait_vnet" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

  # module.acr.azurerm_container_registry.acr will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + data_endpoint_host_names      = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "centralus"
      + login_server                  = (known after apply)
      + name                          = "quotesappacrprod"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-quotesapp-prod"
      + sku                           = "Premium"
      + tags                          = {
          + "Environment" = "Production"
          + "Owner"       = "Rahul"
          + "Project"     = "QuotesApp"
        }
      + trust_policy_enabled          = false
      + zone_redundancy_enabled       = false
    }

  # module.acr.azurerm_private_dns_zone.acr_dns will be created
  + resource "azurerm_private_dns_zone" "acr_dns" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.azurecr.io"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-quotesapp-prod"
      + tags                                                  = {
          + "Environment" = "Production"
          + "Owner"       = "Rahul"
          + "Project"     = "QuotesApp"
        }

      + soa_record (known after apply)
    }

  # module.acr.azurerm_private_dns_zone_virtual_network_link.acr_dns_link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "acr_dns_link" {
      + id                    = (known after apply)
      + name                  = "acr-dns-link-quotesapp"
      + private_dns_zone_name = "privatelink.azurecr.io"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-quotesapp-prod"
      + tags                  = {
          + "Environment" = "Production"
          + "Owner"       = "Rahul"
          + "Project"     = "QuotesApp"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.acr.azurerm_private_endpoint.acr_pe will be created
  + resource "azurerm_private_endpoint" "acr_pe" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "centralus"
      + name                     = "acr-pe-quotesapp"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "rg-quotesapp-prod"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Environment" = "Production"
          + "Owner"       = "Rahul"
          + "Project"     = "QuotesApp"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "acr-dns-zone-group-quotesapp"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "acr-privateserviceconnection-quotesapp"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "registry",
            ]
        }
    }

  # module.app_service.data.azurerm_key_vault.key_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = (sensitive value)
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + rbac_authorization_enabled      = (known after apply)
      + resource_group_name             = (sensitive value)
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.app_service.data.azurerm_key_vault_secret.db_user_login will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "db_user_login" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "SQL-QUOTES-APP-PROD-DB-USER-LOGIN"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # module.app_service.data.azurerm_key_vault_secret.db_user_password will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "db_user_password" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "SQL-QUOTES-APP-PROD-DB-USER-PASSWORD"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # module.app_service.azurerm_linux_web_app.webapp will be created
  + resource "azurerm_linux_web_app" "webapp" {
      + app_settings                                   = (known after apply)
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "centralus"
      + name                                           = "webapp-quotesapp-prod"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + resource_group_name                            = "rg-quotesapp-prod"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "Environment" = "Production"
          + "Owner"       = "Rahul"
          + "Project"     = "QuotesApp"
        }
      + virtual_network_backup_restore_enabled         = false
      + virtual_network_subnet_id                      = (known after apply)
      + vnet_image_pull_enabled                        = true
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = true
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/health"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_image_name   = "quotesapp:latest"
              + docker_registry_url = (known after apply)
            }
        }
    }

  # module.app_service.azurerm_private_dns_zone.appservice_dns will be created
  + resource "azurerm_private_dns_zone" "appservice_dns" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.azurewebsites.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-quotesapp-prod"
      + tags                                                  = {
          + "Environment" = "Production"
          + "Owner"       = "Rahul"
          + "Project"     = "QuotesApp"
        }

      + soa_record (known after apply)
    }

  # module.app_service.azurerm_private_dns_zone_virtual_network_link.appservice_dns_link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "appservice_dns_link" {
      + id                    = (known after apply)
      + name                  = "app-dns-link-quotesapp"
      + private_dns_zone_name = "privatelink.azurewebsites.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-quotesapp-prod"
      + tags                  = {
          + "Environment" = "Production"
          + "Owner"       = "Rahul"
          + "Project"     = "QuotesApp"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.app_service.azurerm_private_endpoint.app_pe will be created
  + resource "azurerm_private_endpoint" "app_pe" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "centralus"
      + name                     = "app-pe-quotesapp"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "rg-quotesapp-prod"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Environment" = "Production"
          + "Owner"       = "Rahul"
          + "Project"     = "QuotesApp"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "app-dns-zone-group-quotesapp"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "app-privateserviceconnection-quotesapp"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites",
            ]
        }
    }

  # module.app_service.azurerm_role_assignment.acr_pull will be created
  + resource "azurerm_role_assignment" "acr_pull" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.app_service.azurerm_service_plan.service_plan will be created
  + resource "azurerm_service_plan" "service_plan" {
      + id                              = (known after apply)
      + kind                            = (known after apply)
      + location                        = "centralus"
      + maximum_elastic_worker_count    = (known after apply)
      + name                            = "service-plan-quotesapp-prod"
      + os_type                         = "Linux"
      + per_site_scaling_enabled        = false
      + premium_plan_auto_scale_enabled = false
      + reserved                        = (known after apply)
      + resource_group_name             = "rg-quotesapp-prod"
      + sku_name                        = "B1"
      + tags                            = {
          + "Environment" = "Production"
          + "Owner"       = "Rahul"
          + "Project"     = "QuotesApp"
        }
      + worker_count                    = (known after apply)
    }

  # module.application_gateway.data.azurerm_key_vault.key_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "quotesappprodkv"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + rbac_authorization_enabled      = (known after apply)
      + resource_group_name             = "terraform-backend-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.application_gateway.azurerm_application_gateway.application_gateway will be created
  + resource "azurerm_application_gateway" "application_gateway" {
      + enable_http2                = true
      + id                          = (known after apply)
      + location                    = "centralus"
      + name                        = "appgateway-quotesapp"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "rg-quotesapp-prod"
      + tags                        = {
          + "Environment" = "Production"
          + "Owner"       = "Rahul"
          + "Project"     = "QuotesApp"
        }

      + backend_address_pool {
          + fqdns        = [
              + "webapp-quotesapp-prod.privatelink.azurewebsites.net",
            ]
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "vnet-quotesapp-prod-beap"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + host_name                           = (known after apply)
          + id                                  = (known after apply)
          + name                                = "vnet-quotesapp-prod-be-htst"
          + pick_host_name_from_backend_address = false
          + port                                = 443
          + probe_id                            = (known after apply)
          + probe_name                          = "vnet-quotesapp-prod-probe"
          + protocol                            = "Https"
          + request_timeout                     = 60
          + trusted_root_certificate_names      = []
            # (2 unchanged attributes hidden)
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "vnet-quotesapp-prod-feip"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = (known after apply)
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "vnet-quotesapp-prod-feport"
          + port = 443
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "ip-configuration-appgateway-quotesapp"
          + subnet_id = (known after apply)
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "vnet-quotesapp-prod-feip"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "vnet-quotesapp-prod-feport"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "vnet-quotesapp-prod-httplstn"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "appgateway-cert-quotesapp"
          + ssl_profile_id                 = (known after apply)
            # (3 unchanged attributes hidden)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + probe {
          + host                                      = (known after apply)
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "vnet-quotesapp-prod-probe"
          + path                                      = "/health"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Https"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3

          + match {
              + status_code = [
                  + "200-399",
                ]
                # (1 unchanged attribute hidden)
            }
        }

      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "vnet-quotesapp-prod-beap"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "vnet-quotesapp-prod-be-htst"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "vnet-quotesapp-prod-httplstn"
          + id                          = (known after apply)
          + name                        = "vnet-quotesapp-prod-rqrt"
          + priority                    = 9
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }

      + sku {
          + capacity = 1
          + name     = "Basic"
          + tier     = "Basic"
        }

      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + ssl_policy (known after apply)
    }

  # module.application_gateway.azurerm_public_ip.pip will be created
  + resource "azurerm_public_ip" "pip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "centralus"
      + name                    = "pip-appgateway-quotesapp"
      + resource_group_name     = "rg-quotesapp-prod"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.application_gateway.azurerm_role_assignment.appgw_kv_secret_access will be created
  + resource "azurerm_role_assignment" "appgw_kv_secret_access" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.application_gateway.azurerm_user_assigned_identity.appgw_identity will be created
  + resource "azurerm_user_assigned_identity" "appgw_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "centralus"
      + name                = "appgw_identity_quotesapp"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-quotesapp-prod"
      + tenant_id           = (known after apply)
    }

  # module.certificate.data.azurerm_key_vault.key_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "quotesappprodkv"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + rbac_authorization_enabled      = (known after apply)
      + resource_group_name             = "terraform-backend-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.certificate.azurerm_key_vault_certificate.ssl_cert will be created
  + resource "azurerm_key_vault_certificate" "ssl_cert" {
      + certificate_attribute           = (known after apply)
      + certificate_data                = (known after apply)
      + certificate_data_base64         = (known after apply)
      + id                              = (known after apply)
      + key_vault_id                    = (known after apply)
      + name                            = "cert-appgateway-quotesapp"
      + resource_manager_id             = (known after apply)
      + resource_manager_versionless_id = (known after apply)
      + secret_id                       = (known after apply)
      + tags                            = {
          + "Environment" = "Production"
          + "Owner"       = "Rahul"
          + "Project"     = "QuotesApp"
        }
      + thumbprint                      = (known after apply)
      + version                         = (known after apply)
      + versionless_id                  = (known after apply)
      + versionless_secret_id           = (known after apply)

      + certificate_policy {
          + issuer_parameters {
              + name = "Self"
            }
          + key_properties {
              + curve      = (known after apply)
              + exportable = true
              + key_size   = 2048
              + key_type   = "RSA"
              + reuse_key  = true
            }
          + lifetime_action {
              + action {
                  + action_type = "AutoRenew"
                }
              + trigger {
                  + days_before_expiry = 30
                }
            }
          + secret_properties {
              + content_type = "application/x-pkcs12"
            }
          + x509_certificate_properties {
              + extended_key_usage = [
                  + "1.3.6.1.5.5.7.3.1",
                ]
              + key_usage          = [
                  + "digitalSignature",
                  + "keyEncipherment",
                ]
              + subject            = "CN=app.quotesapp.com, O=Our Org"
              + validity_in_months = 12

              + subject_alternative_names {
                  + dns_names = [
                      + "app.quotesapp.com",
                    ]
                }
            }
        }
    }

  # module.sql.data.azurerm_key_vault.key_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = (sensitive value)
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + rbac_authorization_enabled      = (known after apply)
      + resource_group_name             = (sensitive value)
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.sql.data.azurerm_key_vault_secret.sql_admin_login will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "sql_admin_login" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "SQL-QUOTES-APP-PROD-ADMIN-LOGIN"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # module.sql.data.azurerm_key_vault_secret.sql_admin_password will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "sql_admin_password" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "SQL-QUOTES-APP-PROD-ADMIN-PASSWORD"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # module.sql.azurerm_mssql_database.sql_database will be created
  + resource "azurerm_mssql_database" "sql_database" {
      + auto_pause_delay_in_minutes                                = (known after apply)
      + collation                                                  = "Latin1_General_100_CI_AS_SC_UTF8"
      + create_mode                                                = "Default"
      + creation_source_database_id                                = (known after apply)
      + enclave_type                                               = "VBS"
      + geo_backup_enabled                                         = true
      + id                                                         = (known after apply)
      + ledger_enabled                                             = (known after apply)
      + license_type                                               = (known after apply)
      + maintenance_configuration_name                             = (known after apply)
      + max_size_gb                                                = 0.5
      + min_capacity                                               = (known after apply)
      + name                                                       = "sqldb-quotesapp-prod"
      + read_replica_count                                         = (known after apply)
      + read_scale                                                 = (known after apply)
      + restore_point_in_time                                      = (known after apply)
      + sample_name                                                = (known after apply)
      + secondary_type                                             = (known after apply)
      + server_id                                                  = (known after apply)
      + sku_name                                                   = "Basic"
      + storage_account_type                                       = "Local"
      + tags                                                       = {
          + "Environment" = "Production"
          + "Owner"       = "Rahul"
          + "Project"     = "QuotesApp"
        }
      + transparent_data_encryption_enabled                        = true
      + transparent_data_encryption_key_automatic_rotation_enabled = false
      + zone_redundant                                             = false

      + long_term_retention_policy (known after apply)

      + short_term_retention_policy (known after apply)

      + threat_detection_policy (known after apply)
    }

  # module.sql.azurerm_mssql_server.sql_server will be created
  + resource "azurerm_mssql_server" "sql_server" {
      + administrator_login                      = (sensitive value)
      + administrator_login_password             = (sensitive value)
      + administrator_login_password_wo          = (write-only attribute)
      + connection_policy                        = "Default"
      + express_vulnerability_assessment_enabled = false
      + fully_qualified_domain_name              = (known after apply)
      + id                                       = (known after apply)
      + location                                 = "centralus"
      + minimum_tls_version                      = "1.2"
      + name                                     = "sqlserver-quotesapp-prod"
      + outbound_network_restriction_enabled     = true
      + primary_user_assigned_identity_id        = (known after apply)
      + public_network_access_enabled            = false
      + resource_group_name                      = "rg-quotesapp-prod"
      + restorable_dropped_database_ids          = (known after apply)
      + tags                                     = {
          + "Environment" = "Production"
          + "Owner"       = "Rahul"
          + "Project"     = "QuotesApp"
        }
      + version                                  = "12.0"
    }

  # module.sql.azurerm_private_dns_zone.sql_dns will be created
  + resource "azurerm_private_dns_zone" "sql_dns" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.database.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-quotesapp-prod"
      + tags                                                  = {
          + "Environment" = "Production"
          + "Owner"       = "Rahul"
          + "Project"     = "QuotesApp"
        }

      + soa_record (known after apply)
    }

  # module.sql.azurerm_private_dns_zone_virtual_network_link.sql_dns_link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "sql_dns_link" {
      + id                    = (known after apply)
      + name                  = "sql-dns-link-quotesapp"
      + private_dns_zone_name = "privatelink.database.windows.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-quotesapp-prod"
      + tags                  = {
          + "Environment" = "Production"
          + "Owner"       = "Rahul"
          + "Project"     = "QuotesApp"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.sql.azurerm_private_endpoint.sql_pe will be created
  + resource "azurerm_private_endpoint" "sql_pe" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "centralus"
      + name                     = "sql-pe-quotesapp"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "rg-quotesapp-prod"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Environment" = "Production"
          + "Owner"       = "Rahul"
          + "Project"     = "QuotesApp"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "sql-dns-zone-group-quotesapp"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "sql-privateserviceconnection-quotesapp"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sqlServer",
            ]
        }
    }

  # module.sql.time_sleep.wait_for_sql will be created
  + resource "time_sleep" "wait_for_sql" {
      + create_duration = "120s"
      + id              = (known after apply)
    }

  # module.subnets.azurerm_nat_gateway.nat will be created
  + resource "azurerm_nat_gateway" "nat" {
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + location                = "centralus"
      + name                    = "quotesapp-nat"
      + resource_group_name     = "rg-quotesapp-prod"
      + resource_guid           = (known after apply)
      + sku_name                = "Standard"
      + tags                    = {
          + "Environment" = "Production"
          + "Owner"       = "Rahul"
          + "Project"     = "QuotesApp"
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.subnets.azurerm_nat_gateway_public_ip_prefix_association.nat will be created
  + resource "azurerm_nat_gateway_public_ip_prefix_association" "nat" {
      + id                  = (known after apply)
      + nat_gateway_id      = (known after apply)
      + public_ip_prefix_id = (known after apply)
    }

  # module.subnets.azurerm_network_security_group.web_nsg will be created
  + resource "azurerm_network_security_group" "web_nsg" {
      + id                  = (known after apply)
      + location            = "centralus"
      + name                = "web-nsg"
      + resource_group_name = "rg-quotesapp-prod"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "Allow-AzureLoadBalancer-In"
              + priority                                   = 130
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "AzureLoadBalancer"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "Allow-HTTPS-In"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "Internet"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "65200-65535"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "Allow-GatewayManager-Ephemeral"
              + priority                                   = 120
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "GatewayManager"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "80"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "Allow-HTTP-In"
              + priority                                   = 110
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "Internet"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
        ]
      + tags                = {
          + "Environment" = "Production"
          + "Owner"       = "Rahul"
          + "Project"     = "QuotesApp"
        }
    }

  # module.subnets.azurerm_public_ip_prefix.nat will be created
  + resource "azurerm_public_ip_prefix" "nat" {
      + id                  = (known after apply)
      + ip_prefix           = (known after apply)
      + ip_version          = "IPv4"
      + location            = "centralus"
      + name                = "quotesapp-pipprefix"
      + prefix_length       = 31
      + resource_group_name = "rg-quotesapp-prod"
      + sku                 = "Standard"
      + sku_tier            = "Regional"
      + tags                = {
          + "Environment" = "Production"
          + "Owner"       = "Rahul"
          + "Project"     = "QuotesApp"
        }
      + zones               = [
          + "1",
          + "2",
          + "3",
        ]
    }

  # module.subnets.azurerm_subnet.app will be created
  + resource "azurerm_subnet" "app" {
      + address_prefixes                              = [
          + "10.0.2.0/23",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "app-subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-quotesapp-prod"
      + virtual_network_name                          = "vnet-quotesapp-prod"

      + delegation {
          + name = "appservice-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.subnets.azurerm_subnet.db will be created
  + resource "azurerm_subnet" "db" {
      + address_prefixes                              = [
          + "10.0.4.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "db-subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = false
      + resource_group_name                           = "rg-quotesapp-prod"
      + virtual_network_name                          = "vnet-quotesapp-prod"
    }

  # module.subnets.azurerm_subnet.mgmt will be created
  + resource "azurerm_subnet" "mgmt" {
      + address_prefixes                              = [
          + "10.0.11.0/27",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "mgmt-subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-quotesapp-prod"
      + virtual_network_name                          = "vnet-quotesapp-prod"
    }

  # module.subnets.azurerm_subnet.pe will be created
  + resource "azurerm_subnet" "pe" {
      + address_prefixes                              = [
          + "10.0.5.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "pe-subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = false
      + resource_group_name                           = "rg-quotesapp-prod"
      + virtual_network_name                          = "vnet-quotesapp-prod"
    }

  # module.subnets.azurerm_subnet.web will be created
  + resource "azurerm_subnet" "web" {
      + address_prefixes                              = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "web-subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-quotesapp-prod"
      + virtual_network_name                          = "vnet-quotesapp-prod"
    }

  # module.subnets.azurerm_subnet_nat_gateway_association.app_nat will be created
  + resource "azurerm_subnet_nat_gateway_association" "app_nat" {
      + id             = (known after apply)
      + nat_gateway_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.subnets.azurerm_subnet_network_security_group_association.web_association will be created
  + resource "azurerm_subnet_network_security_group_association" "web_association" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.subnets.time_sleep.wait_nat will be created
  + resource "time_sleep" "wait_nat" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

  # module.vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space                  = [
          + "10.0.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "centralus"
      + name                           = "vnet-quotesapp-prod"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg-quotesapp-prod"
      + subnet                         = (known after apply)
      + tags                           = {
          + "Environment" = "Production"
          + "Owner"       = "Rahul"
          + "Project"     = "QuotesApp"
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

Plan: 37 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + acr_id                       = (known after apply)
  + acr_login_server             = (known after apply)
  + acr_name                     = "quotesappacrprod"
  + appgateway_public_ip_address = (known after apply)
  + appgateway_public_ip_fqdn    = (known after apply)
  + application_gateway_id       = (known after apply)
  + application_gateway_name     = "appgateway-quotesapp"
  + nat_gateway_id               = (known after apply)
  + service_plan_name            = "service-plan-quotesapp-prod"
  + sql_database_id              = (known after apply)
  + sql_database_name            = "sqldb-quotesapp-prod"
  + sql_server_fqdn              = (known after apply)
  + sql_server_id                = (known after apply)
  + sql_server_name              = "sqlserver-quotesapp-prod"
  + subnet_ids                   = {
      + app  = (known after apply)
      + db   = (known after apply)
      + mgmt = (known after apply)
      + pe   = (known after apply)
      + web  = (known after apply)
    }
  + vnet_id                      = (known after apply)
  + vnet_name                    = "vnet-quotesapp-prod"
  + webapp_default_hostname      = (known after apply)
  + webapp_id                    = (known after apply)
  + webapp_name                  = "webapp-quotesapp-prod"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @nagarajurahul, Action: `pull_request`*